In [1]:
import pandas as pd
client_dictionary = {'name': ['Michael Smith', 'Ana Kors', 'Sean Bill', 'Carl Jonson', 'Bob Evan'], 
                     'grade': [['A', 'A'], ['C'], ['A', 'C', 'B'], [], ['F']], 
                     'age': ['19', '19', '17', '18', '-'],
                     'group': ['class 1', 'class 2', 'class 2', 'class 1', 'class 2'],
                     'suspended': [True, False, True, False, True]
                    }
df = pd.DataFrame(client_dictionary)
df

            name      grade age    group  suspended
0  Michael Smith     [A, A]  19  class 1       True
1       Ana Kors        [C]  19  class 2      False
2      Sean Bill  [A, C, B]  17  class 2       True
3    Carl Jonson         []  18  class 1      False
4       Bob Evan        [F]   -  class 2       True

In [2]:
df.name.str.upper()

0    MICHAEL SMITH
1         ANA KORS
2        SEAN BILL
3      CARL JONSON
4         BOB EVAN
Name: name, dtype: object

In [3]:
df.name.str.lower()

0    michael smith
1         ana kors
2        sean bill
3      carl jonson
4         bob evan
Name: name, dtype: object

In [4]:
df.group.str.replace('class ', '')

0    1
1    2
2    2
3    1
4    2
Name: group, dtype: object

In [5]:
df.group.str.replace(r'[a-z]+ ', '')

0    1
1    2
2    2
3    1
4    2
Name: group, dtype: object

In [6]:
df.name.str.split()

0    [Michael, Smith]
1         [Ana, Kors]
2        [Sean, Bill]
3      [Carl, Jonson]
4         [Bob, Evan]
Name: name, dtype: object

In [7]:
df.name.str.split(',')

0    [Michael Smith]
1         [Ana Kors]
2        [Sean Bill]
3      [Carl Jonson]
4         [Bob Evan]
Name: name, dtype: object

In [8]:
df.name.str.find('s')

0   -1
1    7
2   -1
3    8
4   -1
Name: name, dtype: int64

In [9]:
df.name.str.findall('an')

0      []
1      []
2    [an]
3      []
4    [an]
Name: name, dtype: object

In [10]:
import re
df.name.str.findall('an', flags=re.IGNORECASE)

0      []
1    [An]
2    [an]
3      []
4    [an]
Name: name, dtype: object